hw4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 32]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_with_same_director
    @movie = Movie.find(params[:id])
    if @movie.director
      @movies = Movie.find(params[:id]).find_same_director